Revit 2027 API
AdvancedWood.WoodFiberPerlinProf Property
 The property labeled "Profile for fiber perlin noise" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodFiberPerlinProf { get; }
Public Shared ReadOnly Property WoodFiberPerlinProf As String
	Get
public:
static property String^ WoodFiberPerlinProf {
	String^ get ();
}
static member WoodFiberPerlinProf : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace